analysis/results/mongodb/log_mongodb_f_run2.txt
/opt/java/openjdk/bin/java -cp /opt/ycsb/mongodb-binding/conf:/opt/ycsb/conf:/opt/ycsb/lib/core-0.17.0.jar:/opt/ycsb/lib/HdrHistogram-2.1.4.jar:/opt/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/opt/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/opt/ycsb/lib/jackson-core-asl-1.9.4.jar:/opt/ycsb/mongodb-binding/lib/logback-classic-1.1.2.jar:/opt/ycsb/mongodb-binding/lib/snappy-java-1.1.7.1.jar:/opt/ycsb/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/opt/ycsb/mongodb-binding/lib/logback-core-1.1.2.jar:/opt/ycsb/mongodb-binding/lib/mongodb-binding-0.17.0.jar:/opt/ycsb/mongodb-binding/lib/slf4j-api-1.7.25.jar:/opt/ycsb/mongodb-binding/lib/mongo-java-driver-3.8.0.jar site.ycsb.Client -db site.ycsb.db.MongoDbClient -P /workloads/workload_f.properties -p mongodb.url=mongodb://mongo1:27017,mongo2:27017,mongo3:27017/ycsb?replicaSet=ycsb-rs -p mongodb.writeConcern=majority -p recordcount=1000000 -p operationcount=1000000 -p threadcount=16 -t
Command line: -db site.ycsb.db.MongoDbClient -P /workloads/workload_f.properties -p mongodb.url=mongodb://mongo1:27017,mongo2:27017,mongo3:27017/ycsb?replicaSet=ycsb-rs -p mongodb.writeConcern=majority -p recordcount=1000000 -p operationcount=1000000 -p threadcount=16 -t
YCSB Client 0.17.0

Loading workload...
Starting test.
mongo client connection created with mongodb://mongo1:27017,mongo2:27017,mongo3:27017/ycsb?replicaSet=ycsb-rs&w=majority
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
[OVERALL], RunTime(ms), 1118797
[OVERALL], Throughput(ops/sec), 893.8171982942392
[TOTAL_GCS_G1_Young_Generation], Count, 214
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 1318
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.11780510673518073
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 214
[TOTAL_GC_TIME], Time(ms), 1318
[TOTAL_GC_TIME_%], Time(%), 0.11780510673518073
[READ], Operations, 1000000
[READ], AverageLatency(us), 2466.379023
[READ], MinLatency(us), 190
[READ], MaxLatency(us), 6545407
[READ], 95thPercentileLatency(us), 5343
[READ], 99thPercentileLatency(us), 25119
[READ], Return=OK, 1000000
[READ-MODIFY-WRITE], Operations, 499578
[READ-MODIFY-WRITE], AverageLatency(us), 33213.56977889338
[READ-MODIFY-WRITE], MinLatency(us), 3962
[READ-MODIFY-WRITE], MaxLatency(us), 10977279
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 63967
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 149887
[CLEANUP], Operations, 16
[CLEANUP], AverageLatency(us), 985.5
[CLEANUP], MinLatency(us), 2
[CLEANUP], MaxLatency(us), 15695
[CLEANUP], 95thPercentileLatency(us), 30
[CLEANUP], 99thPercentileLatency(us), 15695
[UPDATE], Operations, 499578
[UPDATE], AverageLatency(us), 30740.544225326175
[UPDATE], MinLatency(us), 3394
[UPDATE], MaxLatency(us), 10977279
[UPDATE], 95thPercentileLatency(us), 61087
[UPDATE], 99thPercentileLatency(us), 135551
[UPDATE], Return=OK, 499578